Repository: J-XZ/deepseek_status
Catalog: DeepSeekBalance/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# a11y.currencyPicker
source: Select trend currency
zh_hans: 选择趋势币种

# a11y.deepseekIcon
source: DeepSeek icon
zh_hans: DeepSeek 图标

# a11y.legend
source: Legend: total, topped-up and granted balance
zh_hans: 图例：总余额、充值余额、赠送余额

# a11y.menuBar
source: DeepSeek usage: %@
zh_hans: DeepSeek 用量：%@

# a11y.status
source: Status: %@
zh_hans: 状态：%@

# action.cancel
source: Cancel
zh_hans: 取消

# action.clear
source: Clear
zh_hans: 清除

# appearance.dark
source: Dark
zh_hans: 深色

# appearance.light
source: Light
zh_hans: 浅色

# apiKey.clear
source: Clear Saved Key
zh_hans: 清除已保存密钥

# apiKey.clearFailed
source: Could not clear saved key: %@
zh_hans: 无法清除已保存的密钥：%@

# apiKey.emptyInput
source: Please enter an API key (cannot be empty)
zh_hans: 请输入 API Key（不能为空）

# apiKey.placeholder
source: Enter DeepSeek API Key
zh_hans: 输入 DeepSeek API Key

# apiKey.save
source: Save
zh_hans: 保存

# apiKey.saveFailed
source: Could not save key: %@
zh_hans: 无法保存密钥：%@

# apiKey.source
source: Key source:
zh_hans: 密钥来源：

# apiKey.source.environment
source: Environment variable DEEPSEEK_API_KEY
zh_hans: 环境变量 DEEPSEEK_API_KEY

# apiKey.source.notConfigured
source: Not configured
zh_hans: 未配置

# app.title
source: DeepSeek API Balance
zh_hans: DeepSeek API 余额

# balance.empty
source: No balance data yet
zh_hans: 暂无余额数据

# balance.granted
source: Granted balance
zh_hans: 赠送余额

# balance.lastUpdated
source: Last updated: %@
zh_hans: 最后更新：%@

# balance.title
source: Balance
zh_hans: 余额

# balance.loading
source: Fetching balance…
zh_hans: 正在获取余额…

# balance.toppedUp
source: Topped-up balance
zh_hans: 充值余额

# balance.total
source: Total balance
zh_hans: 总余额

# common.unknown
source: Unknown
zh_hans: 未知

# component.degraded
source: Degraded performance
zh_hans: 性能下降

# component.majorOutage
source: Major outage
zh_hans: 重大中断

# component.operational
source: Operational
zh_hans: 正常

# component.partialOutage
source: Partial outage
zh_hans: 部分中断

# component.underMaintenance
source: Under maintenance
zh_hans: 维护中

# component.unknown
source: Unknown
zh_hans: 未知

# error.decoding
source: Could not parse the server response
zh_hans: 无法解析服务端响应

# error.history
source: Local history error: %@
zh_hans: 本地历史错误：%@

# error.http
source: Service returned error (%d)
zh_hans: 服务返回错误（%d）

# error.insufficientBalance
source: Insufficient balance (402)
zh_hans: 余额不足（402）

# error.keychain
source: Keychain error: %@
zh_hans: Keychain 错误：%@

# error.noNetwork
source: Cannot connect to the network. Check your connection.
zh_hans: 无法连接网络，请检查网络连接

# error.rateLimited
source: Too many requests, try again later (429)
zh_hans: 请求过于频繁，请稍后再试（429）

# error.server
source: Service temporarily unavailable (%d)
zh_hans: 服务暂时不可用（%d）

# error.serviceStatus
source: Official status temporarily unavailable
zh_hans: 暂时无法获取官方状态信息

# error.timeout
source: Request timed out. Try again later.
zh_hans: 请求超时，请稍后重试

# error.unauthorized
source: Invalid API key (401)
zh_hans: API Key 无效（401）

# error.unknown
source: An unknown error occurred
zh_hans: 发生未知错误

# footer.quit
source: Quit
zh_hans: 退出应用

# footer.refresh
source: Refresh
zh_hans: 刷新

# impact.critical
source: Critical
zh_hans: 严重

# impact.major
source: Major
zh_hans: 重大

# impact.minor
source: Minor
zh_hans: 轻微

# impact.none
source: No impact
zh_hans: 无影响

# impact.unknown
source: Unknown
zh_hans: 未知

# incident.identified
source: Identified
zh_hans: 已确认

# incident.investigating
source: Investigating
zh_hans: 调查中

# incident.monitoring
source: Monitoring
zh_hans: 监控中

# incident.postmortem
source: Postmortem
zh_hans: 事后分析

# incident.resolved
source: Resolved
zh_hans: 已解决

# incident.unknown
source: Unknown
zh_hans: 未知

# indicator.critical
source: Critical Outage
zh_hans: 严重服务中断

# indicator.maintenance
source: Maintenance
zh_hans: 维护中

# indicator.major
source: Major Disruption
zh_hans: 重大服务异常

# indicator.minor
source: Minor Disruption
zh_hans: 轻微服务异常

# indicator.none
source: All Systems Operational
zh_hans: 全部系统正常

# indicator.unknown
source: Unknown
zh_hans: 未知

# legend.granted
source: Granted
zh_hans: 赠送余额

# legend.toppedUp
source: Topped up
zh_hans: 充值余额

# legend.total
source: Total
zh_hans: 总余额

# login.enabled
source: Enabled
zh_hans: 已启用

# login.error
source: Login item operation failed
zh_hans: 登录项操作失败

# login.notFound
source: App not found
zh_hans: 应用未找到

# login.notRegistered
source: Not registered
zh_hans: 未注册

# login.openSettings
source: Open Login Items Settings
zh_hans: 打开登录项设置

# login.requiresApproval
source: Requires approval in System Settings
zh_hans: 需要在系统设置中批准

# menuBar.error
source: Error
zh_hans: 错误

# menuBar.notConfigured
source: Not configured
zh_hans: 未配置

# menu.settings
source: Settings…
zh_hans: 设置…

# menu.barVisibility
source: Menu Bar
zh_hans: 菜单栏显示

# menu.showCodex
source: Show Codex
zh_hans: 显示 Codex

# menu.showDeepSeek
source: Show DeepSeek
zh_hans: 显示 DeepSeek

# menu.openDashboard
source: Open Dashboard
zh_hans: 打开面板

# serviceStatus.api
source: API Service
zh_hans: API 服务

# serviceStatus.incidentImpact
source: Impact: %@
zh_hans: 影响：%@

# serviceStatus.incidentPhase
source: Phase: %@
zh_hans: 阶段：%@

# serviceStatus.incidentUpdated
source: Last updated: %@
zh_hans: 最近更新：%@

# serviceStatus.incidents
source: Open incidents
zh_hans: 未解决事件

# serviceStatus.lastUpdated
source: Last successful update: %@
zh_hans: 最后成功更新：%@

# serviceStatus.loading
source: Fetching official status…
zh_hans: 正在获取官方状态…

# serviceStatus.maintenance
source: Scheduled maintenance
zh_hans: 计划维护

# serviceStatus.openPage
source: Open Official Status Page
zh_hans: 打开官方状态页

# serviceStatus.otherComponents
source: Other components
zh_hans: 其他组件

# serviceStatus.overall
source: Overall status
zh_hans: 整体状态

# serviceStatus.refresh
source: Refresh Service Status
zh_hans: 刷新服务状态

# serviceStatus.stale
source: Possibly stale
zh_hans: 状态可能不是最新

# serviceStatus.title
source: DeepSeek Service Status
zh_hans: DeepSeek 服务状态

# serviceStatus.titleCodex
source: Codex Service Status
zh_hans: Codex 服务状态

# serviceStatus.titleCursor
source: Cursor Service Status
zh_hans: Cursor 服务状态

# serviceStatus.unavailable
source: Official status temporarily unavailable
zh_hans: 暂时无法获取官方状态信息

# serviceStatus.webChat
source: Web Chat Service
zh_hans: 网页对话服务

# settings.appearance
source: Appearance
zh_hans: 外观

# settings.language
source: Language
zh_hans: 语言

# settings.languageSwitch
source: 中文
zh_hans: English

# settings.launchAtLogin
source: Launch at Login
zh_hans: 登录时启动

# settings.localHistory
source: Local History
zh_hans: 本地历史

# settings.title
source: Settings
zh_hans: 设置

# status.insufficientBalance
source: Insufficient balance
zh_hans: 余额不足

# status.keychainError
source: Keychain error
zh_hans: Keychain 错误

# status.loaded
source: Available
zh_hans: 可用

# status.loading
source: Loading
zh_hans: 加载中

# status.notConfigured
source: Not configured
zh_hans: 未配置

# status.requestFailed
source: Request failed
zh_hans: 请求失败

# trend.clearConfirmMessage
source: This removes locally saved samples from the last 3 days. It does not affect your API key or current balance.
zh_hans: 将删除本机保存的最近 3 天历史样本。不影响 API Key 与当前余额。

# trend.clearConfirmTitle
source: Clear Local History?
zh_hans: 清除本地历史？

# trend.clearHistory
source: Clear Local History
zh_hans: 清除本地历史

# trend.currencyPicker
source: Currency
zh_hans: 币种

# trend.emptyTitle
source: Not enough history data yet
zh_hans: 尚无足够历史数据

# trend.emptyUnavailable
source: Your balance works normally, but local history is temporarily unavailable.
zh_hans: 当前余额可正常使用，但本地历史记录暂时不可用。

# trend.emptyWaiting
source: Recording starts after the first successful fetch, keeping one sample per 10-minute bucket.
zh_hans: 应用会从首次成功获取数据后开始记录，每 10 分钟保留一个采样。

# trend.historyErrorPrefix
source: Local history error: %@
zh_hans: 本地历史错误：%@

# trend.localNote
source: History is stored locally only and kept for up to 3 days.
zh_hans: 历史仅保存在本机，最多保留 3 天。

# trend.selectionChange
source: vs previous sample %@
zh_hans: 较前样本 %@

# trend.summaryChange
source: 72h change: %@
zh_hans: 72 小时变化：%@

# trend.summaryInsufficient
source: 72h change: not enough samples
zh_hans: 72 小时变化：样本不足

# trend.title
source: 3-Day Balance Trend
zh_hans: 最近 3 天余额趋势

# tab.deepseek
source: DeepSeek Usage
zh_hans: DeepSeek 用量

# tab.codex
source: Codex Usage
zh_hans: Codex 用量

# codex.title
source: Codex Usage
zh_hans: Codex 用量

# codex.plan
source: Plan
zh_hans: 订阅方案

# codex.planUnknown
source: Unknown
zh_hans: 未知

# codex.account
source: Account: %@
zh_hans: 账号：%@

# codex.windowWeekly
source: Weekly window
zh_hans: 每周窗口

# codex.windowFiveHour
source: 5-hour window
zh_hans: 5 小时窗口

# codex.windowDaily
source: Daily window
zh_hans: 每日窗口

# codex.windowGeneric
source: Usage window
zh_hans: 用量窗口

# codex.windowUsedRemaining
source: Used %lld%% · %lld%% remaining
zh_hans: 已用 %lld%% · 剩余 %lld%%

# codex.expectedMarker
source: Expected usage at this point in the usage window
zh_hans: 当前用量周期的预期消耗位置

# codex.resetAt
source: Resets at %@
zh_hans: 重置时间：%@

# codex.limitAllowed
source: Available
zh_hans: 可用

# codex.limitReached
source: Usage limit reached
zh_hans: 已达到用量上限

# codex.noLimit
source: No usage limit info
zh_hans: 无用量限制信息

# codex.freePlan
source: Free plan, no usage limits
zh_hans: 免费计划，无用量限制

# codex.creditsTitle
source: Credits
zh_hans: 额外额度

# codex.creditsNone
source: None
zh_hans: 无

# codex.creditsUnlimited
source: Unlimited
zh_hans: 无限

# codex.creditsBalance
source: Balance
zh_hans: 余额

# codex.loading
source: Fetching Codex usage…
zh_hans: 正在获取 Codex 用量…

# codex.empty
source: No Codex usage data yet
zh_hans: 暂无 Codex 用量数据

# codex.notConfigured
source: Codex sign-in not found
zh_hans: 未找到 Codex 登录信息

# codex.notConfiguredDetail
source: Run codex login on this Mac or place ~/.codex/auth.json
zh_hans: 请先在本机运行 codex login，或放置 ~/.codex/auth.json

# codex.authInvalid
source: Codex session expired. Run codex login again.
zh_hans: Codex 登录已失效，请重新运行 codex login。

# codex.trendInsufficient
source: Not enough history for a trend yet
zh_hans: 历史数据不足，暂无法生成趋势

# codex.trendSummary
source: 72 h change in remaining usage: %@
zh_hans: 近 72 小时剩余用量变化：%@

# codex.trendTitle
source: Usage Trend
zh_hans: 用量趋势

# codex.lastUpdated
source: Last updated: %@
zh_hans: 最后更新：%@

# a11y.codexIcon
source: Codex icon
zh_hans: Codex 图标

# a11y.menuBarCodex
source: Codex usage: %@
zh_hans: Codex 用量：%@

# codex.windowFiveHourNone
source: No 5-hour limit data available
zh_hans: 暂无 5 小时用量限制信息

# tab.cursor
source: Cursor Usage
zh_hans: Cursor 用量

# cursor.title
source: Cursor Usage
zh_hans: Cursor 用量

# cursor.plan
source: Plan
zh_hans: 订阅方案

# cursor.planUnknown
source: Unknown
zh_hans: 未知

# cursor.account
source: Account: %@
zh_hans: 账号：%@

# cursor.windowTitle
source: Billing cycle
zh_hans: 计费周期

# cursor.windowUsedRemaining
source: Used %lld%% · %lld%% remaining
zh_hans: 已用 %lld%% · 剩余 %lld%%

# cursor.resetAt
source: Resets at %@
zh_hans: 重置时间：%@

# cursor.expectedMarker
source: Expected usage at this point in the billing cycle
zh_hans: 当前计费周期的预期用量位置

# cursor.limitAllowed
source: Available
zh_hans: 可用

# cursor.limitReached
source: Usage limit reached
zh_hans: 已达到用量上限

# cursor.noLimit
source: No usage limit info
zh_hans: 无用量限制信息

# cursor.freePlan
source: No usage-limit information available
zh_hans: 暂无用量限制信息

# cursor.apiChannel
source: API channel
zh_hans: API 通道

# cursor.spendTitle
source: Spend this cycle
zh_hans: 本周期费用

# cursor.spendTotal
source: Total spent
zh_hans: 总支出

# cursor.spendIncluded
source: Included spend
zh_hans: 套餐内费用

# cursor.spendBonus
source: Bonus spend
zh_hans: 赠送额度费用

# cursor.spendLimit
source: Plan limit
zh_hans: 方案上限

# cursor.loading
source: Fetching Cursor usage…
zh_hans: 正在获取 Cursor 用量…

# cursor.empty
source: No Cursor usage data yet
zh_hans: 暂无 Cursor 用量数据

# cursor.notConfigured
source: Cursor sign-in not found
zh_hans: 未找到 Cursor 登录信息

# cursor.notConfiguredDetail
source: Run cursor agent login on this Mac to sign in
zh_hans: 请先在本机运行 cursor agent login 登录

# cursor.authInvalid
source: Cursor session expired. Sign in again with cursor agent login
zh_hans: Cursor 登录已失效，请重新运行 cursor agent login 登录

# cursor.lastUpdated
source: Last updated: %@
zh_hans: 最后更新：%@

# cursor.trendTitle
source: Usage Trend
zh_hans: 用量趋势

# cursor.trendSummary
source: 72 h change in remaining usage: %@
zh_hans: 近 72 小时剩余用量变化：%@

# cursor.trendInsufficient
source: Not enough history for a trend yet
zh_hans: 历史数据不足，暂无法生成趋势

# cursor.trendFirstParty
source: First-party models
zh_hans: 第一方模型

# menu.showCursor
source: Show Cursor
zh_hans: 显示 Cursor

# a11y.cursorIcon
source: Cursor icon
zh_hans: Cursor 图标

# a11y.menuBarCursor
source: Cursor usage: %@
zh_hans: Cursor 用量：%@

# a11y.codexLegend
source: Codex remaining usage trend chart
zh_hans: Codex 剩余用量趋势图

# a11y.cursorLegend
source: Cursor first-party and API remaining usage trend chart
zh_hans: Cursor 第一方与 API 剩余用量趋势图

# a11y.providerPicker
source: Usage provider
zh_hans: 用量服务

# settings.languageSwitchHelp
source: Switch language
zh_hans: 切换语言

# chart.time
source: Time
zh_hans: 时间

# chart.amount
source: Amount
zh_hans: 金额

# chart.remaining
source: Remaining
zh_hans: 剩余

# chart.segment
source: Segment
zh_hans: 分段

# chart.channel
source: Channel
zh_hans: 通道

# chart.selectedTime
source: Selected time
zh_hans: 选中时间

# login.errorDetail
source: Login item operation failed: %@
zh_hans: 登录项操作失败：%@

# login.unknownStatus
source: Unknown login item status
zh_hans: 未知的登录项状态

# a11y.menuBarOpenCode
source: OpenCode usage: %@
zh_hans: OpenCode 用量：%@

# a11y.openCodeGoLegend
source: OpenCode Go usage windows and Zen balance trend
zh_hans: OpenCode Go 用量窗口与 Zen 余额趋势

# a11y.openCodeIcon
source: OpenCode icon
zh_hans: OpenCode 图标

# a11y.openCodeZenLegend
source: OpenCode Zen balance trend
zh_hans: OpenCode Zen 余额趋势

# menu.showOpenCode
source: Show OpenCode
zh_hans: 显示 OpenCode

# openCode.authInvalid
source: Cookie expired
zh_hans: Cookie 已过期

# openCode.cookieClear
source: Clear Saved Cookie
zh_hans: 清除已保存 Cookie

# openCode.cookieEmpty
source: Please enter Cookie content or a file path.
zh_hans: 请输入 Cookie 内容或文件路径。

# openCode.cookieFileReadFailed
source: Could not read the Cookie file.
zh_hans: 无法读取 Cookie 文件。

# openCode.cookieHelp
source: Paste a complete Netscape Cookie file, or paste its local path (for example ~/Downloads/cookies.txt). Only the OpenCode auth cookie is stored in Keychain.
zh_hans: 可粘贴完整 Netscape Cookie 文件内容，也可粘贴本机路径（例如 ~/Downloads/cookies.txt）。应用只会把 OpenCode 登录 Cookie 保存到 Keychain。

# openCode.cookieInvalid
source: No valid opencode.ai auth cookie was found.
zh_hans: 未找到有效的 opencode.ai 登录 Cookie。

# openCode.cookiePlaceholder
source: Paste Netscape Cookie content or a local file path
zh_hans: 粘贴 Netscape Cookie 内容或本机文件路径

# openCode.cookieSave
source: Save and Refresh
zh_hans: 保存并刷新

# openCode.cookieSaveFailed
source: Could not save Cookie: %@
zh_hans: 无法保存 Cookie：%@

# openCode.cookieSource
source: Cookie source:
zh_hans: Cookie 来源：

# openCode.cookieSourceNotConfigured
source: Not configured
zh_hans: 未配置

# openCode.empty
source: Add an OpenCode Cookie below to load Go and Zen data.
zh_hans: 请在下方添加 OpenCode Cookie 以加载 Go 和 Zen 数据。

# openCode.errorDecoding
source: Could not parse the OpenCode response.
zh_hans: 无法解析 OpenCode 响应。

# openCode.errorHttp
source: OpenCode returned an error (%d).
zh_hans: OpenCode 返回错误（%d）。

# openCode.errorInvalidCookie
source: The saved OpenCode Cookie is invalid.
zh_hans: 已保存的 OpenCode Cookie 无效。

# openCode.errorKeychain
source: Keychain error: %@
zh_hans: Keychain 错误：%@

# openCode.errorNoNetwork
source: Cannot connect to OpenCode. Check your network.
zh_hans: 无法连接 OpenCode，请检查网络。

# openCode.errorServer
source: OpenCode is temporarily unavailable (%d).
zh_hans: OpenCode 暂时不可用（%d）。

# openCode.errorTimeout
source: The OpenCode request timed out.
zh_hans: OpenCode 请求超时。

# openCode.errorUnauthorized
source: The OpenCode Cookie is expired or unauthorized.
zh_hans: OpenCode Cookie 已过期或无权限。

# openCode.lastUpdated
source: Last updated: %@
zh_hans: 最后更新：%@

# openCode.loading
source: Loading OpenCode data…
zh_hans: 正在加载 OpenCode 数据…

# openCode.noData
source: Unavailable
zh_hans: 暂无数据

# openCode.noSubscription
source: Not subscribed
zh_hans: 未订阅

# openCode.noSubscriptionDetail
source: No active OpenCode Go subscription was found. The red bar indicates that no subscription is available.
zh_hans: 未找到有效的 OpenCode Go 订阅。红色进度条表示当前没有可用订阅。

# openCode.notConfigured
source: Not configured
zh_hans: 未配置

# openCode.progress
source: %d%% used · %d%% remaining
zh_hans: 已用 %d%% · 剩余 %d%%

# openCode.subscribed
source: Subscribed
zh_hans: 已订阅

# openCode.trendGo
source: Go usage windows
zh_hans: Go 用量窗口

# openCode.trendGoSummary
source: Go monthly usage change: %@ percentage points
zh_hans: Go 月度用量变化：%@ 个百分点

# openCode.trendInsufficient
source: Not enough history yet
zh_hans: 历史数据不足

# openCode.trendTitle
source: OpenCode Trends
zh_hans: OpenCode 趋势

# openCode.trendWaiting
source: Waiting for two samples to draw a line
zh_hans: 等待至少两个样本后绘制折线

# openCode.trendZen
source: Zen balance
zh_hans: Zen 余额

# openCode.trendZenSummary
source: Balance change: %@
zh_hans: 余额变化：%@

# openCode.usageUnavailable
source: Subscription found, but no usage window is currently available.
zh_hans: 已找到订阅，但当前没有可用的用量窗口。

# openCode.windowMonthly
source: Monthly window
zh_hans: 月度窗口

# openCode.windowRolling
source: 5-hour window
zh_hans: 5 小时窗口

# openCode.windowWeekly
source: Weekly window
zh_hans: 每周窗口

# openCode.zenDescription
source: Pay-as-you-go Zen balance
zh_hans: 按量付费的 Zen 余额
